zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/ambiq-apollo4-pinctrl.h
/*
 * Copyright (c) 2023 Antmicro <www.antmicro.com>
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @file
 * @brief Devicetree pin control helpers for Ambiq Apollo4
 * @ingroup pinctrl_apollo4
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_AMBIQ_APOLLO4_PINCTRL_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_AMBIQ_APOLLO4_PINCTRL_H_

/**
 * @addtogroup ambiq_pinctrl Ambiq pin control helpers
 * @ingroup devicetree-pinctrl
 */

/**
 * @defgroup pinctrl_apollo4 Ambiq Apollo4 pin control helpers
 * @brief Macros for pin control configuration of Ambiq Apollo4
 * @ingroup ambiq_pinctrl
 *
 * The macros follow the following naming convention:
 * @c \<FUNCTION\>\_P\<PIN\>.
 *
 * For example, @c UART0TX_P60 corresponds to selecting the @c UART0TX function
 * on pin @c 60.
 *
 * @code{.dts}
 * #include <zephyr/dt-bindings/pinctrl/ambiq-apollo4-pinctrl.h>
 *
 * &pinctrl {
 *         uart0_default: uart0_default {
 *                 group1 {
 *                         pinmux = <UART0TX_P60>;
 *                 };
 *                 group2 {
 *                         pinmux = <UART0RX_P47>;
 *                         input-enable;
 *                 };
 *         };
 * };
 * @endcode
 *
 * @{
 */

/** @cond INTERNAL_HIDDEN */

#define APOLLO4_ALT_FUNC_POS 0
#define APOLLO4_ALT_FUNC_MASK 0xf

#define APOLLO4_PIN_NUM_POS 4
#define APOLLO4_PIN_NUM_MASK 0x7f

#define APOLLO4_PINMUX(pin_num, alt_func) (pin_num << APOLLO4_PIN_NUM_POS | \
					alt_func << APOLLO4_ALT_FUNC_POS)

#define SWTRACECLK_P0 APOLLO4_PINMUX(0, 0)
#define SLSCL_P0 APOLLO4_PINMUX(0, 1)
#define SLSCK_P0 APOLLO4_PINMUX(0, 2)
#define GPIO_P0 APOLLO4_PINMUX(0, 3)
#define UART0TX_P0 APOLLO4_PINMUX(0, 4)
#define UART1TX_P0 APOLLO4_PINMUX(0, 5)
#define CT0_P0 APOLLO4_PINMUX(0, 6)
#define NCE0_P0 APOLLO4_PINMUX(0, 7)
#define OBSBUS0_P0 APOLLO4_PINMUX(0, 8)
#define VCMPO_P0 APOLLO4_PINMUX(0, 9)
#define FPIO_P0 APOLLO4_PINMUX(0, 11)
#define SWTRACE0_P1 APOLLO4_PINMUX(1, 0)
#define SLSDAWIR3_P1 APOLLO4_PINMUX(1, 1)
#define SLMOSI_P1 APOLLO4_PINMUX(1, 2)
#define GPIO_P1 APOLLO4_PINMUX(1, 3)
#define UART2TX_P1 APOLLO4_PINMUX(1, 4)
#define UART3TX_P1 APOLLO4_PINMUX(1, 5)
#define CT1_P1 APOLLO4_PINMUX(1, 6)
#define NCE1_P1 APOLLO4_PINMUX(1, 7)
#define OBSBUS1_P1 APOLLO4_PINMUX(1, 8)
#define VCMPO_P1 APOLLO4_PINMUX(1, 9)
#define FPIO_P1 APOLLO4_PINMUX(1, 11)
#define SCANIN4_P1 APOLLO4_PINMUX(1, 15)
#define SWTRACE1_P2 APOLLO4_PINMUX(2, 0)
#define SLMISO_P2 APOLLO4_PINMUX(2, 1)
#define TRIG1_P2 APOLLO4_PINMUX(2, 2)
#define GPIO_P2 APOLLO4_PINMUX(2, 3)
#define UART0RX_P2 APOLLO4_PINMUX(2, 4)
#define UART1RX_P2 APOLLO4_PINMUX(2, 5)
#define CT2_P2 APOLLO4_PINMUX(2, 6)
#define NCE2_P2 APOLLO4_PINMUX(2, 7)
#define OBSBUS2_P2 APOLLO4_PINMUX(2, 8)
#define VCMPO_P2 APOLLO4_PINMUX(2, 9)
#define FPIO_P2 APOLLO4_PINMUX(2, 11)
#define SCANRSTN_P2 APOLLO4_PINMUX(2, 15)
#define SWTRACE2_P3 APOLLO4_PINMUX(3, 0)
#define SLNCE_P3 APOLLO4_PINMUX(3, 1)
#define SWO_P3 APOLLO4_PINMUX(3, 2)
#define GPIO_P3 APOLLO4_PINMUX(3, 3)
#define UART2RX_P3 APOLLO4_PINMUX(3, 4)
#define UART3RX_P3 APOLLO4_PINMUX(3, 5)
#define CT3_P3 APOLLO4_PINMUX(3, 6)
#define NCE3_P3 APOLLO4_PINMUX(3, 7)
#define OBSBUS3_P3 APOLLO4_PINMUX(3, 8)
#define FPIO_P3 APOLLO4_PINMUX(3, 11)
#define SCANIN5_P3 APOLLO4_PINMUX(3, 15)
#define SWTRACE3_P4 APOLLO4_PINMUX(4, 0)
#define SLINT_P4 APOLLO4_PINMUX(4, 1)
#define XT32KHZ_P4 APOLLO4_PINMUX(4, 2)
#define GPIO_P4 APOLLO4_PINMUX(4, 3)
#define UART0RTS_P4 APOLLO4_PINMUX(4, 4)
#define UART1RTS_P4 APOLLO4_PINMUX(4, 5)
#define CT4_P4 APOLLO4_PINMUX(4, 6)
#define NCE4_P4 APOLLO4_PINMUX(4, 7)
#define OBSBUS4_P4 APOLLO4_PINMUX(4, 8)
#define I2S0_SDIN_P4 APOLLO4_PINMUX(4, 9)
#define I2S1_SDIN_P4 APOLLO4_PINMUX(4, 10)
#define FPIO_P4 APOLLO4_PINMUX(4, 11)
#define FLB_TDO_P4 APOLLO4_PINMUX(4, 12)
#define FLLOAD_DIR_P4 APOLLO4_PINMUX(4, 13)
#define MDA_TDO_P4 APOLLO4_PINMUX(4, 14)
#define OPCG_TRIG_P4 APOLLO4_PINMUX(4, 15)
#define M0SCL_P5 APOLLO4_PINMUX(5, 0)
#define M0SCK_P5 APOLLO4_PINMUX(5, 1)
#define I2S0_CLK_P5 APOLLO4_PINMUX(5, 2)
#define GPIO_P5 APOLLO4_PINMUX(5, 3)
#define UART2RTS_P5 APOLLO4_PINMUX(5, 4)
#define UART3RTS_P5 APOLLO4_PINMUX(5, 5)
#define CT5_P5 APOLLO4_PINMUX(5, 6)
#define NCE5_P5 APOLLO4_PINMUX(5, 7)
#define OBSBUS5_P5 APOLLO4_PINMUX(5, 8)
#define I2S1_CLK_P5 APOLLO4_PINMUX(5, 10)
#define FPIO_P5 APOLLO4_PINMUX(5, 11)
#define FLB_TDI_P5 APOLLO4_PINMUX(5, 12)
#define FLLOAD_DATA_P5 APOLLO4_PINMUX(5, 13)
#define MDA_SRST_P5 APOLLO4_PINMUX(5, 14)
#define DFT_ISO_P5 APOLLO4_PINMUX(5, 15)
#define M0SDAWIR3_P6 APOLLO4_PINMUX(6, 0)
#define M0MOSI_P6 APOLLO4_PINMUX(6, 1)
#define I2S0_DATA_P6 APOLLO4_PINMUX(6, 2)
#define GPIO_P6 APOLLO4_PINMUX(6, 3)
#define UART0CTS_P6 APOLLO4_PINMUX(6, 4)
#define UART1CTS_P6 APOLLO4_PINMUX(6, 5)
#define CT6_P6 APOLLO4_PINMUX(6, 6)
#define NCE6_P6 APOLLO4_PINMUX(6, 7)
#define OBSBUS6_P6 APOLLO4_PINMUX(6, 8)
#define I2S0_SDOUT_P6 APOLLO4_PINMUX(6, 9)
#define I2S1_SDOUT_P6 APOLLO4_PINMUX(6, 10)
#define FPIO_P6 APOLLO4_PINMUX(6, 11)
#define SCANIN6_P6 APOLLO4_PINMUX(6, 15)
#define M0MISO_P7 APOLLO4_PINMUX(7, 0)
#define TRIG0_P7 APOLLO4_PINMUX(7, 1)
#define I2S0_WS_P7 APOLLO4_PINMUX(7, 2)
#define GPIO_P7 APOLLO4_PINMUX(7, 3)
#define UART2CTS_P7 APOLLO4_PINMUX(7, 4)
#define UART3CTS_P7 APOLLO4_PINMUX(7, 5)
#define CT7_P7 APOLLO4_PINMUX(7, 6)
#define NCE7_P7 APOLLO4_PINMUX(7, 7)
#define OBSBUS7_P7 APOLLO4_PINMUX(7, 8)
#define I2S1_WS_P7 APOLLO4_PINMUX(7, 10)
#define FPIO_P7 APOLLO4_PINMUX(7, 11)
#define SCANIN7_P7 APOLLO4_PINMUX(7, 15)
#define CMPRF1_P8 APOLLO4_PINMUX(8, 0)
#define TRIG1_P8 APOLLO4_PINMUX(8, 1)
#define GPIO_P8 APOLLO4_PINMUX(8, 3)
#define M1SCL_P8 APOLLO4_PINMUX(8, 4)
#define M1SCK_P8 APOLLO4_PINMUX(8, 5)
#define CT8_P8 APOLLO4_PINMUX(8, 6)
#define NCE8_P8 APOLLO4_PINMUX(8, 7)
#define OBSBUS8_P8 APOLLO4_PINMUX(8, 8)
#define FPIO_P8 APOLLO4_PINMUX(8, 11)
#define SCANOUT4_P8 APOLLO4_PINMUX(8, 15)
#define CMPRF0_P9 APOLLO4_PINMUX(9, 0)
#define TRIG2_P9 APOLLO4_PINMUX(9, 1)
#define GPIO_P9 APOLLO4_PINMUX(9, 3)
#define M1SDAWIR3_P9 APOLLO4_PINMUX(9, 4)
#define M1MOSI_P9 APOLLO4_PINMUX(9, 5)
#define CT9_P9 APOLLO4_PINMUX(9, 6)
#define NCE9_P9 APOLLO4_PINMUX(9, 7)
#define OBSBUS9_P9 APOLLO4_PINMUX(9, 8)
#define FPIO_P9 APOLLO4_PINMUX(9, 11)
#define SCANOUT5_P9 APOLLO4_PINMUX(9, 15)
#define CMPIN0_P10 APOLLO4_PINMUX(10, 0)
#define TRIG3_P10 APOLLO4_PINMUX(10, 1)
#define GPIO_P10 APOLLO4_PINMUX(10, 3)
#define M1MISO_P10 APOLLO4_PINMUX(10, 4)
#define CT10_P10 APOLLO4_PINMUX(10, 6)
#define NCE10_P10 APOLLO4_PINMUX(10, 7)
#define OBSBUS10_P10 APOLLO4_PINMUX(10, 8)
#define DISP_TE_P10 APOLLO4_PINMUX(10, 9)
#define FPIO_P10 APOLLO4_PINMUX(10, 11)
#define OPCG_LOAD_P10 APOLLO4_PINMUX(10, 15)
#define CMPIN1_P11 APOLLO4_PINMUX(11, 0)
#define TRIG0_P11 APOLLO4_PINMUX(11, 1)
#define I2S0_CLK_P11 APOLLO4_PINMUX(11, 2)
#define GPIO_P11 APOLLO4_PINMUX(11, 3)
#define UART2RX_P11 APOLLO4_PINMUX(11, 4)
#define UART3RX_P11 APOLLO4_PINMUX(11, 5)
#define CT11_P11 APOLLO4_PINMUX(11, 6)
#define NCE11_P11 APOLLO4_PINMUX(11, 7)
#define OBSBUS11_P11 APOLLO4_PINMUX(11, 8)
#define FPIO_P11 APOLLO4_PINMUX(11, 11)
#define FLB_TCLK_P11 APOLLO4_PINMUX(11, 12)
#define FLLOAD_ADDR_P11 APOLLO4_PINMUX(11, 13)
#define MDA_TCK_P11 APOLLO4_PINMUX(11, 14)
#define SCANIN0_P11 APOLLO4_PINMUX(11, 15)
#define ADCSE7_P12 APOLLO4_PINMUX(12, 0)
#define TRIG1_P12 APOLLO4_PINMUX(12, 1)
#define I2S0_DATA_P12 APOLLO4_PINMUX(12, 2)
#define GPIO_P12 APOLLO4_PINMUX(12, 3)
#define UART0TX_P12 APOLLO4_PINMUX(12, 4)
#define UART1TX_P12 APOLLO4_PINMUX(12, 5)
#define CT12_P12 APOLLO4_PINMUX(12, 6)
#define NCE12_P12 APOLLO4_PINMUX(12, 7)
#define OBSBUS12_P12 APOLLO4_PINMUX(12, 8)
#define CMPRF2_P12 APOLLO4_PINMUX(12, 9)
#define I2S0_SDOUT_P12 APOLLO4_PINMUX(12, 10)
#define FPIO_P12 APOLLO4_PINMUX(12, 11)
#define SCANOUT3_P12 APOLLO4_PINMUX(12, 15)
#define ADCSE6_P13 APOLLO4_PINMUX(13, 0)
#define TRIG2_P13 APOLLO4_PINMUX(13, 1)
#define I2S0_WS_P13 APOLLO4_PINMUX(13, 2)
#define GPIO_P13 APOLLO4_PINMUX(13, 3)
#define UART2TX_P13 APOLLO4_PINMUX(13, 4)
#define UART3TX_P13 APOLLO4_PINMUX(13, 5)
#define CT13_P13 APOLLO4_PINMUX(13, 6)
#define NCE13_P13 APOLLO4_PINMUX(13, 7)
#define OBSBUS13_P13 APOLLO4_PINMUX(13, 8)
#define FPIO_P13 APOLLO4_PINMUX(13, 11)
#define FLB_FCLK_P13 APOLLO4_PINMUX(13, 12)
#define FLLOAD_DATA_P13 APOLLO4_PINMUX(13, 13)
#define MDA_TDI_P13 APOLLO4_PINMUX(13, 14)
#define SCANOUT0_P13 APOLLO4_PINMUX(13, 15)
#define ADCSE5_P14 APOLLO4_PINMUX(14, 0)
#define TRIG3_P14 APOLLO4_PINMUX(14, 1)
#define GPIO_P14 APOLLO4_PINMUX(14, 3)
#define MILLI_CLK_P14 APOLLO4_PINMUX(14, 4)
#define UART1RX_P14 APOLLO4_PINMUX(14, 5)
#define CT14_P14 APOLLO4_PINMUX(14, 6)
#define NCE14_P14 APOLLO4_PINMUX(14, 7)
#define OBSBUS14_P14 APOLLO4_PINMUX(14, 8)
#define I2S0_SDIN_P14 APOLLO4_PINMUX(14, 10)
#define FPIO_P14 APOLLO4_PINMUX(14, 11)
#define FLLOAD_ADDR_P14 APOLLO4_PINMUX(14, 13)
#define MDA_TRSTN_P14 APOLLO4_PINMUX(14, 14)
#define SCANOUT2_P14 APOLLO4_PINMUX(14, 15)
#define ADCSE4_P15 APOLLO4_PINMUX(15, 0)
#define TRIG0_P15 APOLLO4_PINMUX(15, 1)
#define GPIO_P15 APOLLO4_PINMUX(15, 3)
#define MILLI_REC_DAT_P15 APOLLO4_PINMUX(15, 4)
#define UART3RX_P15 APOLLO4_PINMUX(15, 5)
#define CT15_P15 APOLLO4_PINMUX(15, 6)
#define NCE15_P15 APOLLO4_PINMUX(15, 7)
#define OBSBUS15_P15 APOLLO4_PINMUX(15, 8)
#define REFCLK_EXT_P15 APOLLO4_PINMUX(15, 10)
#define FPIO_P15 APOLLO4_PINMUX(15, 11)
#define FLLOAD_DATA_P15 APOLLO4_PINMUX(15, 13)
#define SCANOUT1_P15 APOLLO4_PINMUX(15, 15)
#define ADCSE3_P16 APOLLO4_PINMUX(16, 0)
#define TRIG1_P16 APOLLO4_PINMUX(16, 1)
#define I2S1_CLK_P16 APOLLO4_PINMUX(16, 2)
#define GPIO_P16 APOLLO4_PINMUX(16, 3)
#define MILLI_PBDATA1_P16 APOLLO4_PINMUX(16, 4)
#define UART1RTS_P16 APOLLO4_PINMUX(16, 5)
#define CT16_P16 APOLLO4_PINMUX(16, 6)
#define NCE16_P16 APOLLO4_PINMUX(16, 7)
#define OBSBUS0_P16 APOLLO4_PINMUX(16, 8)
#define FPIO_P16 APOLLO4_PINMUX(16, 11)
#define DFT_RET_P16 APOLLO4_PINMUX(16, 15)
#define ADCSE2_P17 APOLLO4_PINMUX(17, 0)
#define TRIG2_P17 APOLLO4_PINMUX(17, 1)
#define I2S1_DATA_P17 APOLLO4_PINMUX(17, 2)
#define GPIO_P17 APOLLO4_PINMUX(17, 3)
#define MILLI_PBDATA2_P17 APOLLO4_PINMUX(17, 4)
#define UART3RTS_P17 APOLLO4_PINMUX(17, 5)
#define CT17_P17 APOLLO4_PINMUX(17, 6)
#define NCE17_P17 APOLLO4_PINMUX(17, 7)
#define OBSBUS1_P17 APOLLO4_PINMUX(17, 8)
#define I2S1_SDOUT_P17 APOLLO4_PINMUX(17, 9)
#define FPIO_P17 APOLLO4_PINMUX(17, 11)
#define FLLOAD_STRB_P17 APOLLO4_PINMUX(17, 13)
#define MDA_TMS_P17 APOLLO4_PINMUX(17, 14)
#define OPCG_CLK_P17 APOLLO4_PINMUX(17, 15)
#define ADCSE1_P18 APOLLO4_PINMUX(18, 0)
#define ANATEST2_P18 APOLLO4_PINMUX(18, 1)
#define I2S1_WS_P18 APOLLO4_PINMUX(18, 2)
#define GPIO_P18 APOLLO4_PINMUX(18, 3)
#define UART0CTS_P18 APOLLO4_PINMUX(18, 4)
#define UART1CTS_P18 APOLLO4_PINMUX(18, 5)
#define CT18_P18 APOLLO4_PINMUX(18, 6)
#define NCE18_P18 APOLLO4_PINMUX(18, 7)
#define OBSBUS2_P18 APOLLO4_PINMUX(18, 8)
#define FPIO_P18 APOLLO4_PINMUX(18, 11)
#define FLB_TMS_P18 APOLLO4_PINMUX(18, 12)
#define FLLOAD_DATA_P18 APOLLO4_PINMUX(18, 13)
#define MDA_HFRC_EXT_P18 APOLLO4_PINMUX(18, 14)
#define SCANIN1_P18 APOLLO4_PINMUX(18, 15)
#define ADCSE0_P19 APOLLO4_PINMUX(19, 0)
#define ANATEST1_P19 APOLLO4_PINMUX(19, 1)
#define GPIO_P19 APOLLO4_PINMUX(19, 3)
#define UART2CTS_P19 APOLLO4_PINMUX(19, 4)
#define UART3CTS_P19 APOLLO4_PINMUX(19, 5)
#define CT19_P19 APOLLO4_PINMUX(19, 6)
#define NCE19_P19 APOLLO4_PINMUX(19, 7)
#define OBSBUS3_P19 APOLLO4_PINMUX(19, 8)
#define I2S1_SDIN_P19 APOLLO4_PINMUX(19, 9)
#define FPIO_P19 APOLLO4_PINMUX(19, 11)
#define FLB_TRSTN_P19 APOLLO4_PINMUX(19, 12)
#define FLLOAD_ADDR_P19 APOLLO4_PINMUX(19, 13)
#define SCANIN2_P19 APOLLO4_PINMUX(19, 15)
#define SWDCK_P20 APOLLO4_PINMUX(20, 0)
#define TRIG1_P20 APOLLO4_PINMUX(20, 1)
#define GPIO_P20 APOLLO4_PINMUX(20, 3)
#define UART0TX_P20 APOLLO4_PINMUX(20, 4)
#define UART1TX_P20 APOLLO4_PINMUX(20, 5)
#define CT20_P20 APOLLO4_PINMUX(20, 6)
#define NCE20_P20 APOLLO4_PINMUX(20, 7)
#define OBSBUS4_P20 APOLLO4_PINMUX(20, 8)
#define FPIO_P20 APOLLO4_PINMUX(20, 11)
#define SCANCLK_P20 APOLLO4_PINMUX(20, 15)
#define SWDIO_P21 APOLLO4_PINMUX(21, 0)
#define TRIG2_P21 APOLLO4_PINMUX(21, 1)
#define GPIO_P21 APOLLO4_PINMUX(21, 3)
#define UART2TX_P21 APOLLO4_PINMUX(21, 4)
#define UART3TX_P21 APOLLO4_PINMUX(21, 5)
#define CT21_P21 APOLLO4_PINMUX(21, 6)
#define NCE21_P21 APOLLO4_PINMUX(21, 7)
#define OBSBUS5_P21 APOLLO4_PINMUX(21, 8)
#define FPIO_P21 APOLLO4_PINMUX(21, 11)
#define SCANSHFT_P21 APOLLO4_PINMUX(21, 15)
#define M7SCL_P22 APOLLO4_PINMUX(22, 0)
#define M7SCK_P22 APOLLO4_PINMUX(22, 1)
#define SWO_P22 APOLLO4_PINMUX(22, 2)
#define GPIO_P22 APOLLO4_PINMUX(22, 3)
#define UART0RX_P22 APOLLO4_PINMUX(22, 4)
#define UART1RX_P22 APOLLO4_PINMUX(22, 5)
#define CT22_P22 APOLLO4_PINMUX(22, 6)
#define NCE22_P22 APOLLO4_PINMUX(22, 7)
#define OBSBUS6_P22 APOLLO4_PINMUX(22, 8)
#define VCMPO_P22 APOLLO4_PINMUX(22, 9)
#define I3CM1_SCL_P22 APOLLO4_PINMUX(22, 10)
#define FPIO_P22 APOLLO4_PINMUX(22, 11)
#define SCANIN3_P22 APOLLO4_PINMUX(22, 15)
#define M7SDAWIR3_P23 APOLLO4_PINMUX(23, 0)
#define M7MOSI_P23 APOLLO4_PINMUX(23, 1)
#define SWO_P23 APOLLO4_PINMUX(23, 2)
#define GPIO_P23 APOLLO4_PINMUX(23, 3)
#define UART2RX_P23 APOLLO4_PINMUX(23, 4)
#define UART3RX_P23 APOLLO4_PINMUX(23, 5)
#define CT23_P23 APOLLO4_PINMUX(23, 6)
#define NCE23_P23 APOLLO4_PINMUX(23, 7)
#define OBSBUS7_P23 APOLLO4_PINMUX(23, 8)
#define VCMPO_P23 APOLLO4_PINMUX(23, 9)
#define I3CM1_SDA_P23 APOLLO4_PINMUX(23, 10)
#define FPIO_P23 APOLLO4_PINMUX(23, 11)
#define SCANOUT6_P23 APOLLO4_PINMUX(23, 15)
#define M7MISO_P24 APOLLO4_PINMUX(24, 0)
#define TRIG3_P24 APOLLO4_PINMUX(24, 1)
#define SWO_P24 APOLLO4_PINMUX(24, 2)
#define GPIO_P24 APOLLO4_PINMUX(24, 3)
#define UART0RTS_P24 APOLLO4_PINMUX(24, 4)
#define UART1RTS_P24 APOLLO4_PINMUX(24, 5)
#define CT24_P24 APOLLO4_PINMUX(24, 6)
#define NCE24_P24 APOLLO4_PINMUX(24, 7)
#define OBSBUS8_P24 APOLLO4_PINMUX(24, 8)
#define FPIO_P24 APOLLO4_PINMUX(24, 11)
#define SCANOUT7_P24 APOLLO4_PINMUX(24, 15)
#define M2SCL_P25 APOLLO4_PINMUX(25, 0)
#define M2SCK_P25 APOLLO4_PINMUX(25, 1)
#define GPIO_P25 APOLLO4_PINMUX(25, 3)
#define LFRC_EXT_P25 APOLLO4_PINMUX(25, 4)
#define DSP_TMS_P25 APOLLO4_PINMUX(25, 5)
#define CT25_P25 APOLLO4_PINMUX(25, 6)
#define NCE25_P25 APOLLO4_PINMUX(25, 7)
#define OBSBUS9_P25 APOLLO4_PINMUX(25, 8)
#define FPIO_P25 APOLLO4_PINMUX(25, 11)
#define SCANIN8_P25 APOLLO4_PINMUX(25, 15)
#define M2SDAWIR3_P26 APOLLO4_PINMUX(26, 0)
#define M2MOSI_P26 APOLLO4_PINMUX(26, 1)
#define GPIO_P26 APOLLO4_PINMUX(26, 3)
#define HFRC_EXT_P26 APOLLO4_PINMUX(26, 4)
#define CT26_P26 APOLLO4_PINMUX(26, 6)
#define NCE26_P26 APOLLO4_PINMUX(26, 7)
#define OBSBUS10_P26 APOLLO4_PINMUX(26, 8)
#define VCMPO_P26 APOLLO4_PINMUX(26, 9)
#define FPIO_P26 APOLLO4_PINMUX(26, 11)
#define SCANIN9_P26 APOLLO4_PINMUX(26, 15)
#define M2MISO_P27 APOLLO4_PINMUX(27, 0)
#define TRIG0_P27 APOLLO4_PINMUX(27, 1)
#define GPIO_P27 APOLLO4_PINMUX(27, 3)
#define XT_EXT_P27 APOLLO4_PINMUX(27, 4)
#define DSP_TCK_P27 APOLLO4_PINMUX(27, 5)
#define CT27_P27 APOLLO4_PINMUX(27, 6)
#define NCE27_P27 APOLLO4_PINMUX(27, 7)
#define OBSBUS11_P27 APOLLO4_PINMUX(27, 8)
#define I2S0_SDIN_P27 APOLLO4_PINMUX(27, 9)
#define FPIO_P27 APOLLO4_PINMUX(27, 11)
#define SCANIN10_P27 APOLLO4_PINMUX(27, 15)
#define SWO_P28 APOLLO4_PINMUX(28, 0)
#define VCMPO_P28 APOLLO4_PINMUX(28, 1)
#define I2S0_CLK_P28 APOLLO4_PINMUX(28, 2)
#define GPIO_P28 APOLLO4_PINMUX(28, 3)
#define UART2CTS_P28 APOLLO4_PINMUX(28, 4)
#define DSP_TDO_P28 APOLLO4_PINMUX(28, 5)
#define CT28_P28 APOLLO4_PINMUX(28, 6)
#define NCE28_P28 APOLLO4_PINMUX(28, 7)
#define OBSBUS12_P28 APOLLO4_PINMUX(28, 8)
#define FPIO_P28 APOLLO4_PINMUX(28, 11)
#define CME_P28 APOLLO4_PINMUX(28, 15)
#define TRIG0_P29 APOLLO4_PINMUX(29, 0)
#define VCMPO_P29 APOLLO4_PINMUX(29, 1)
#define I2S0_DATA_P29 APOLLO4_PINMUX(29, 2)
#define GPIO_P29 APOLLO4_PINMUX(29, 3)
#define UART1CTS_P29 APOLLO4_PINMUX(29, 4)
#define DSP_TRSTN_P29 APOLLO4_PINMUX(29, 5)
#define CT29_P29 APOLLO4_PINMUX(29, 6)
#define NCE29_P29 APOLLO4_PINMUX(29, 7)
#define OBSBUS13_P29 APOLLO4_PINMUX(29, 8)
#define I2S0_SDOUT_P29 APOLLO4_PINMUX(29, 9)
#define FPIO_P29 APOLLO4_PINMUX(29, 11)
#define CMLE_P29 APOLLO4_PINMUX(29, 15)
#define TRIG1_P30 APOLLO4_PINMUX(30, 0)
#define VCMPO_P30 APOLLO4_PINMUX(30, 1)
#define I2S0_WS_P30 APOLLO4_PINMUX(30, 2)
#define GPIO_P30 APOLLO4_PINMUX(30, 3)
#define UART0TX_P30 APOLLO4_PINMUX(30, 4)
#define DSP_TDI_P30 APOLLO4_PINMUX(30, 5)
#define CT30_P30 APOLLO4_PINMUX(30, 6)
#define NCE30_P30 APOLLO4_PINMUX(30, 7)
#define OBSBUS14_P30 APOLLO4_PINMUX(30, 8)
#define FPIO_P30 APOLLO4_PINMUX(30, 11)
#define SCANOUT8_P30 APOLLO4_PINMUX(30, 15)
#define M3SCL_P31 APOLLO4_PINMUX(31, 0)
#define M3SCK_P31 APOLLO4_PINMUX(31, 1)
#define GPIO_P31 APOLLO4_PINMUX(31, 3)
#define UART2TX_P31 APOLLO4_PINMUX(31, 4)
#define CT31_P31 APOLLO4_PINMUX(31, 6)
#define NCE31_P31 APOLLO4_PINMUX(31, 7)
#define OBSBUS15_P31 APOLLO4_PINMUX(31, 8)
#define VCMPO_P31 APOLLO4_PINMUX(31, 9)
#define FPIO_P31 APOLLO4_PINMUX(31, 11)
#define SCANOUT9_P31 APOLLO4_PINMUX(31, 15)
#define M3SDAWIR3_P32 APOLLO4_PINMUX(32, 0)
#define M3MOSI_P32 APOLLO4_PINMUX(32, 1)
#define GPIO_P32 APOLLO4_PINMUX(32, 3)
#define UART0RX_P32 APOLLO4_PINMUX(32, 4)
#define CT32_P32 APOLLO4_PINMUX(32, 6)
#define NCE32_P32 APOLLO4_PINMUX(32, 7)
#define OBSBUS0_P32 APOLLO4_PINMUX(32, 8)
#define FPIO_P32 APOLLO4_PINMUX(32, 11)
#define SCANOUT10_P32 APOLLO4_PINMUX(32, 15)
#define M3MISO_P33 APOLLO4_PINMUX(33, 0)
#define CLKOUT_P33 APOLLO4_PINMUX(33, 1)
#define GPIO_P33 APOLLO4_PINMUX(33, 3)
#define UART2RX_P33 APOLLO4_PINMUX(33, 4)
#define CT33_P33 APOLLO4_PINMUX(33, 6)
#define NCE33_P33 APOLLO4_PINMUX(33, 7)
#define OBSBUS1_P33 APOLLO4_PINMUX(33, 8)
#define DISP_TE_P33 APOLLO4_PINMUX(33, 9)
#define FPIO_P33 APOLLO4_PINMUX(33, 11)
#define SCANOUT11_P33 APOLLO4_PINMUX(33, 15)
#define M4SCL_P34 APOLLO4_PINMUX(34, 0)
#define M4SCK_P34 APOLLO4_PINMUX(34, 1)
#define SWO_P34 APOLLO4_PINMUX(34, 2)
#define GPIO_P34 APOLLO4_PINMUX(34, 3)
#define UART0TX_P34 APOLLO4_PINMUX(34, 4)
#define CT34_P34 APOLLO4_PINMUX(34, 6)
#define NCE34_P34 APOLLO4_PINMUX(34, 7)
#define OBSBUS2_P34 APOLLO4_PINMUX(34, 8)
#define VCMPO_P34 APOLLO4_PINMUX(34, 9)
#define FPIO_P34 APOLLO4_PINMUX(34, 11)
#define M4SDAWIR3_P35 APOLLO4_PINMUX(35, 0)
#define M4MOSI_P35 APOLLO4_PINMUX(35, 1)
#define SWO_P35 APOLLO4_PINMUX(35, 2)
#define GPIO_P35 APOLLO4_PINMUX(35, 3)
#define UART2TX_P35 APOLLO4_PINMUX(35, 4)
#define UART3TX_P35 APOLLO4_PINMUX(35, 5)
#define CT35_P35 APOLLO4_PINMUX(35, 6)
#define NCE35_P35 APOLLO4_PINMUX(35, 7)
#define OBSBUS3_P35 APOLLO4_PINMUX(35, 8)
#define VCMPO_P35 APOLLO4_PINMUX(35, 9)
#define FPIO_P35 APOLLO4_PINMUX(35, 11)
#define M4MISO_P36 APOLLO4_PINMUX(36, 0)
#define TRIG0_P36 APOLLO4_PINMUX(36, 1)
#define SWO_P36 APOLLO4_PINMUX(36, 2)
#define GPIO_P36 APOLLO4_PINMUX(36, 3)
#define UART0RX_P36 APOLLO4_PINMUX(36, 4)
#define UART1RX_P36 APOLLO4_PINMUX(36, 5)
#define CT36_P36 APOLLO4_PINMUX(36, 6)
#define NCE36_P36 APOLLO4_PINMUX(36, 7)
#define OBSBUS4_P36 APOLLO4_PINMUX(36, 8)
#define FPIO_P36 APOLLO4_PINMUX(36, 11)
#define MSPI1_0_P37 APOLLO4_PINMUX(37, 0)
#define TRIG1_P37 APOLLO4_PINMUX(37, 1)
#define XT32KHZ_P37 APOLLO4_PINMUX(37, 2)
#define GPIO_P37 APOLLO4_PINMUX(37, 3)
#define UART2RX_P37 APOLLO4_PINMUX(37, 4)
#define DISP_D15_P37 APOLLO4_PINMUX(37, 5)
#define CT37_P37 APOLLO4_PINMUX(37, 6)
#define NCE37_P37 APOLLO4_PINMUX(37, 7)
#define OBSBUS5_P37 APOLLO4_PINMUX(37, 8)
#define FPIO_P37 APOLLO4_PINMUX(37, 11)
#define MSPI1_1_P38 APOLLO4_PINMUX(38, 0)
#define TRIG2_P38 APOLLO4_PINMUX(38, 1)
#define SWTRACECLK_P38 APOLLO4_PINMUX(38, 2)
#define GPIO_P38 APOLLO4_PINMUX(38, 3)
#define UART0RTS_P38 APOLLO4_PINMUX(38, 4)
#define DISP_D16_P38 APOLLO4_PINMUX(38, 5)
#define CT38_P38 APOLLO4_PINMUX(38, 6)
#define NCE38_P38 APOLLO4_PINMUX(38, 7)
#define OBSBUS6_P38 APOLLO4_PINMUX(38, 8)
#define FPIO_P38 APOLLO4_PINMUX(38, 11)
#define MSPI1_2_P39 APOLLO4_PINMUX(39, 0)
#define TRIG3_P39 APOLLO4_PINMUX(39, 1)
#define SWTRACE0_P39 APOLLO4_PINMUX(39, 2)
#define GPIO_P39 APOLLO4_PINMUX(39, 3)
#define UART2RTS_P39 APOLLO4_PINMUX(39, 4)
#define DISP_D17_P39 APOLLO4_PINMUX(39, 5)
#define CT39_P39 APOLLO4_PINMUX(39, 6)
#define NCE39_P39 APOLLO4_PINMUX(39, 7)
#define OBSBUS7_P39 APOLLO4_PINMUX(39, 8)
#define FPIO_P39 APOLLO4_PINMUX(39, 11)
#define MSPI1_3_P40 APOLLO4_PINMUX(40, 0)
#define TRIG1_P40 APOLLO4_PINMUX(40, 1)
#define SWTRACE1_P40 APOLLO4_PINMUX(40, 2)
#define GPIO_P40 APOLLO4_PINMUX(40, 3)
#define UART0CTS_P40 APOLLO4_PINMUX(40, 4)
#define DISP_D18_P40 APOLLO4_PINMUX(40, 5)
#define CT40_P40 APOLLO4_PINMUX(40, 6)
#define NCE40_P40 APOLLO4_PINMUX(40, 7)
#define OBSBUS8_P40 APOLLO4_PINMUX(40, 8)
#define FPIO_P40 APOLLO4_PINMUX(40, 11)
#define MSPI1_4_P41 APOLLO4_PINMUX(41, 0)
#define TRIG0_P41 APOLLO4_PINMUX(41, 1)
#define SWTRACE2_P41 APOLLO4_PINMUX(41, 2)
#define GPIO_P41 APOLLO4_PINMUX(41, 3)
#define UART0TX_P41 APOLLO4_PINMUX(41, 4)
#define DISP_D19_P41 APOLLO4_PINMUX(41, 5)
#define CT41_P41 APOLLO4_PINMUX(41, 6)
#define NCE41_P41 APOLLO4_PINMUX(41, 7)
#define OBSBUS9_P41 APOLLO4_PINMUX(41, 8)
#define SWO_P41 APOLLO4_PINMUX(41, 9)
#define FPIO_P41 APOLLO4_PINMUX(41, 11)
#define MSPI1_5_P42 APOLLO4_PINMUX(42, 0)
#define TRIG2_P42 APOLLO4_PINMUX(42, 1)
#define SWTRACE3_P42 APOLLO4_PINMUX(42, 2)
#define GPIO_P42 APOLLO4_PINMUX(42, 3)
#define UART2TX_P42 APOLLO4_PINMUX(42, 4)
#define DISP_D20_P42 APOLLO4_PINMUX(42, 5)
#define CT42_P42 APOLLO4_PINMUX(42, 6)
#define NCE42_P42 APOLLO4_PINMUX(42, 7)
#define OBSBUS10_P42 APOLLO4_PINMUX(42, 8)
#define FPIO_P42 APOLLO4_PINMUX(42, 11)
#define MSPI1_6_P43 APOLLO4_PINMUX(43, 0)
#define TRIG3_P43 APOLLO4_PINMUX(43, 1)
#define SWTRACECTL_P43 APOLLO4_PINMUX(43, 2)
#define GPIO_P43 APOLLO4_PINMUX(43, 3)
#define UART0RX_P43 APOLLO4_PINMUX(43, 4)
#define DISP_D21_P43 APOLLO4_PINMUX(43, 5)
#define CT43_P43 APOLLO4_PINMUX(43, 6)
#define NCE43_P43 APOLLO4_PINMUX(43, 7)
#define OBSBUS11_P43 APOLLO4_PINMUX(43, 8)
#define FPIO_P43 APOLLO4_PINMUX(43, 11)
#define MSPI1_7_P44 APOLLO4_PINMUX(44, 0)
#define TRIG1_P44 APOLLO4_PINMUX(44, 1)
#define SWO_P44 APOLLO4_PINMUX(44, 2)
#define GPIO_P44 APOLLO4_PINMUX(44, 3)
#define UART2RX_P44 APOLLO4_PINMUX(44, 4)
#define DISP_D22_P44 APOLLO4_PINMUX(44, 5)
#define CT44_P44 APOLLO4_PINMUX(44, 6)
#define NCE44_P44 APOLLO4_PINMUX(44, 7)
#define OBSBUS12_P44 APOLLO4_PINMUX(44, 8)
#define VCMPO_P44 APOLLO4_PINMUX(44, 9)
#define FPIO_P44 APOLLO4_PINMUX(44, 11)
#define MSPI1_8_P45 APOLLO4_PINMUX(45, 0)
#define TRIG2_P45 APOLLO4_PINMUX(45, 1)
#define XT32KHZ_P45 APOLLO4_PINMUX(45, 2)
#define GPIO_P45 APOLLO4_PINMUX(45, 3)
#define UART0TX_P45 APOLLO4_PINMUX(45, 4)
#define DISP_D23_P45 APOLLO4_PINMUX(45, 5)
#define CT45_P45 APOLLO4_PINMUX(45, 6)
#define NCE45_P45 APOLLO4_PINMUX(45, 7)
#define OBSBUS13_P45 APOLLO4_PINMUX(45, 8)
#define FPIO_P45 APOLLO4_PINMUX(45, 11)
#define MSPI1_9_P46 APOLLO4_PINMUX(46, 0)
#define TRIG3_P46 APOLLO4_PINMUX(46, 1)
#define CLKOUT_32M_P46 APOLLO4_PINMUX(46, 2)
#define GPIO_P46 APOLLO4_PINMUX(46, 3)
#define UART2TX_P46 APOLLO4_PINMUX(46, 4)
#define UART3TX_P46 APOLLO4_PINMUX(46, 5)
#define CT46_P46 APOLLO4_PINMUX(46, 6)
#define NCE46_P46 APOLLO4_PINMUX(46, 7)
#define OBSBUS14_P46 APOLLO4_PINMUX(46, 8)
#define I2S1_SDIN_P46 APOLLO4_PINMUX(46, 9)
#define I2S0_SDIN_P46 APOLLO4_PINMUX(46, 10)
#define FPIO_P46 APOLLO4_PINMUX(46, 11)
#define M5SCL_P47 APOLLO4_PINMUX(47, 0)
#define M5SCK_P47 APOLLO4_PINMUX(47, 1)
#define I2S1_CLK_P47 APOLLO4_PINMUX(47, 2)
#define GPIO_P47 APOLLO4_PINMUX(47, 3)
#define UART0RX_P47 APOLLO4_PINMUX(47, 4)
#define UART1RX_P47 APOLLO4_PINMUX(47, 5)
#define CT47_P47 APOLLO4_PINMUX(47, 6)
#define NCE47_P47 APOLLO4_PINMUX(47, 7)
#define OBSBUS15_P47 APOLLO4_PINMUX(47, 8)
#define I2S0_CLK_P47 APOLLO4_PINMUX(47, 10)
#define FPIO_P47 APOLLO4_PINMUX(47, 11)
#define M5SDAWIR3_P48 APOLLO4_PINMUX(48, 0)
#define M5MOSI_P48 APOLLO4_PINMUX(48, 1)
#define I2S1_DATA_P48 APOLLO4_PINMUX(48, 2)
#define GPIO_P48 APOLLO4_PINMUX(48, 3)
